Repository: alexiarstein/kernelinstall
Catalog: po/*.po
Languages: es

source: Running
es: Ejecutando

source: Command failed: %s (exit %d)
es: Comando falló: %s (salida %d)

source: whiptail not found. Installing...
es: whiptail no encontrado. Instalando...

source: Cannot install whiptail on this distribution
es: No se puede instalar whiptail en esta distribución

source: Failed to install whiptail
es: Falló la instalación de whiptail

source: whiptail installed successfully. Restarting application...
es: whiptail instalado exitosamente. Reiniciando aplicación...

source: Failed to restart
es: Falló el reinicio

source: Alexia Kernel Installer
es: Instalador de Kernel Alexia

source: Alexia Kernel Installer Version
es: Versión del Instalador de Kernel Alexia

source: This program will download, compile and install the latest stable kernel from kernel.org.
es: Este programa descargará, compilará e instalará el último kernel estable desde kernel.org.

source: The process may take up to three hours in some systems.
es: El proceso puede tomar hasta tres horas en algunos sistemas.

source: Do you wish to continue
es: ¿Desea continuar?

source: Cleanup Build Files
es: Limpiar Archivos de Compilación

source: Do you want to clean up the build files
es: ¿Desea limpiar los archivos de compilación?

source: Secure Boot enrollment skipped.
es: Inscripción de Secure Boot omitida.

source: You can enroll the certificate later with: sudo mokutil --import /var/lib/shim-signed/mok/MOK_goldendoglinux.der
es: Puede inscribir el certificado después con: sudo mokutil --import /var/lib/shim-signed/mok/MOK_goldendoglinux.der

source: Installation Complete
es: Instalación Completada

source: Reboot Now
es: Reiniciar Ahora

source: Reboot Later
es: Reiniciar Después

source: has been successfully installed
es: ha sido instalado exitosamente

source: If you enrolled Secure Boot, complete the enrollment during reboot
es: Si inscribió Secure Boot, complete la inscripción durante el reinicio

source: Rebooting system...
es: Reiniciando sistema...

source: Remember: If you enrolled Secure Boot, look for the blue MOK Manager screen!
es: ¡Recuerde: Si inscribió Secure Boot, busque la pantalla azul de MOK Manager!

source: Remember to reboot the machine to boot with the latest kernel
es: Recuerde reiniciar la máquina para arrancar con el último kernel

source: Thank you for using my software
es: Gracias por usar mi software

source: Please keep it free for everyone
es: Por favor manténgalo libre para todos

source: Could not determine home directory
es: No se pudo determinar el directorio home

source: Unsupported Linux distribution. Currently only Debian-based systems are supported.
es: Distribución Linux no soportada. Actualmente solo sistemas basados en Debian están soportados.

source: Detected distribution: %s
es: Distribución detectada: %s

source: Whiptail installation failed. Continuing with text mode...
es: Instalación de Whiptail falló. Continuando en modo texto...

source: Installation cancelled by user.
es: Instalación cancelada por el usuario.

source: Creating build directory: %s
es: Creando directorio de compilación: %s

source: Path exists but is not a directory: %s
es: La ruta existe pero no es un directorio: %s

source: Failed to create build directory
es: Falló al crear el directorio de compilación

source: Installing required packages for %s...
es: Instalando paquetes requeridos para %s...

source: Fetching latest kernel version from kernel.org...
es: Obteniendo la última versión del kernel desde kernel.org...

source: Could not fetch latest kernel version.
es: No se pudo obtener la última versión del kernel.

source: Empty version string.
es: Cadena de versión vacía.

source: Latest stable kernel: %s
es: Último kernel estable: %s

source: Building and installing kernel for %s...
es: Compilando e instalando kernel para %s...

source: Updating bootloader for %s...
es: Actualizando gestor de arranque para %s...

source: Build files cleaned up.
es: Archivos de compilación limpiados.

source: Generating initramfs with dracut for Arch Linux...
es: Generando initramfs con dracut para Arch Linux...

source: Updating GRUB for Arch Linux...
es: Actualizando GRUB para Arch Linux...

source: Regenerating initramfs with dracut...
es: Regenerando initramfs con dracut...

source: Generating initramfs with dracut for Fedora...
es: Generando initramfs con dracut para Fedora...

source: Updating GRUB2 for Fedora...
es: Actualizando GRUB2 para Fedora...

source: Generating GoldenDogLinux Secure Boot certificate...
es: Generando certificado GoldenDogLinux para Secure Boot...

source: GoldenDogLinux certificate generated successfully.
es: Certificado GoldenDogLinux generado exitosamente.

source: Secure Boot Enrollment
es: Inscripción de Secure Boot

source: Do you want to enroll the GoldenDogLinux certificate for Secure Boot?
es: ¿Desea inscribir el certificado GoldenDogLinux para Secure Boot?

source: This will allow your custom kernel to work with Secure Boot enabled.
es: Esto permitirá que su kernel personalizado funcione con Secure Boot activado.

source: You will be asked to set a password and enroll the key during the next reboot.
es: Se le pedirá establecer una contraseña e inscribir la clave durante el próximo reinicio.

source: Continue with enrollment?
es: ¿Continuar con la inscripción?

source: Enrolling GoldenDogLinux certificate for Secure Boot...
es: Inscribiendo certificado GoldenDogLinux para Secure Boot...

source: === IMPORTANT SECURE BOOT INSTRUCTIONS ===
es: === INSTRUCCIONES IMPORTANTES DE SECURE BOOT ===

source: 1. You will be asked to set a enrollment password now
es: 1. Se le pedirá establecer una contraseña de inscripción ahora

source: 2. During the next reboot, a blue screen (MOK Manager) will appear
es: 2. Durante el próximo reinicio, aparecerá una pantalla azul (MOK Manager)

source: 3. Select 'Enroll MOK' > 'Continue' > 'Yes' > Enter the password
es: 3. Seleccione 'Enroll MOK' > 'Continue' > 'Yes' > Ingrese la contraseña

source: 4. Select 'Reboot' to complete the enrollment
es: 4. Seleccione 'Reboot' para completar la inscripción

source: 5. After enrollment, your kernel will work with Secure Boot
es: 5. Después de la inscripción, su kernel funcionará con Secure Boot

source: Configuring GoldendogLinux Signature...
es: Configurando Firma GoldendogLinux...

source: Generating initramfs with dracut for Soplos Linux...
es: Generando initramfs con dracut para Soplos Linux...

source: Updating GRUB for Soplos Linux...
es: Actualizando GRUB para Soplos Linux...

source: Download, compile and install the latest stable kernel from kernel.org
es: Descarga, compila e instala el último kernel estable desde kernel.org

source: System Information
es: Información del Sistema

source: Detecting distribution...
es: Detectando distribución...

source: Detecting initramfs system...
es: Detectando sistema initramfs...

source: Current kernel:
es: Kernel actual:

source: Installation Progress
es: Progreso de la Instalación

source: Ready
es: Listo

source: Start Installation
es: Iniciar Instalación

source: Cancel
es: Cancelar

source: Close
es: Cerrar

source: Unknown
es: Desconocido

source: Distribution:
es: Distribución:

source: Distribution: Unknown
es: Distribución: Desconocida

source: Not detected
es: No detectado

source: Initramfs system:
es: Sistema initramfs:

source: Start Kernel Installation?
es: ¿Iniciar Instalación del Kernel?

source: This process will download, compile and install the latest stable kernel. It may take several hours depending on your system. Do you want to continue?
es: Este proceso descargará, compilará e instalará el último kernel estable. Puede tomar varias horas dependiendo de tu sistema. ¿Deseas continuar?

source: Installing...
es: Instalando...

source: Error: kernel-installer not found!
es: Error: ¡kernel-installer no encontrado!

source: Cancel Installation?
es: ¿Cancelar Instalación?

source: Are you sure you want to cancel the installation?
es: ¿Estás seguro de que deseas cancelar la instalación?

source: Cancelled
es: Cancelado

source: Installation in progress
es: Instalación en progreso

source: An installation is in progress. Are you sure you want to exit?
es: Hay una instalación en progreso. ¿Estás seguro de que deseas salir?

source: Warning: Running GUI as root is not recommended.
es: Advertencia: No se recomienda ejecutar la GUI como root.
